In [1]:
import pandas as pd

In [2]:
trips = pd.read_csv("Seattle_cycles_trip.csv")
stations = pd.read_csv("Seattle_cycles_station.csv")
weather = pd.read_csv("Seattle_weather_daily.csv")

C:\Users\Admin\AppData\Local\Temp\ipykernel_2060\3025706063.py:1: DtypeWarning: Columns (11) have mixed types. Specify dtype option on import or set low_memory=False.
  trips = pd.read_csv("Seattle_cycles_trip.csv")

In [3]:
trips.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 286858 entries, 0 to 286857
Data columns (total 12 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   trip_id            286858 non-null  int64
 1   starttime          286858 non-null  object
 2   stoptime           286858 non-null  object
 3   bikeid             286858 non-null  object
 4   tripduration       286858 non-null  float64
 5   from_station_name  286858 non-null  object
 6   to_station_name    286858 non-null  object
 7   from_station_id    286858 non-null  object
 8   to_station_id      286858 non-null  object
 9   usertype           286858 non-null  object
 10  gender             181558 non-null  object
 11  birthyear          181554 non-null  object
dtypes: float64(1), int64(1), object(10)
memory usage: 26.3+ MB

In [4]:
trips['starttime'] = pd.to_datetime(trips['starttime'])

In [5]:
trips.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 286858 entries, 0 to 286857
Data columns (total 12 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   trip_id            286858 non-null  int64
 1   starttime          286858 non-null  datetime64[ns]
 2   stoptime           286858 non-null  object
 3   bikeid             286858 non-null  object
 4   tripduration       286858 non-null  float64
 5   from_station_name  286858 non-null  object
 6   to_station_name    286858 non-null  object
 7   from_station_id    286858 non-null  object
 8   to_station_id      286858 non-null  object
 9   usertype           286858 non-null  object
 10  gender             181558 non-null  object
 11  birthyear          181554 non-null  object
dtypes: datetime64[ns](1), float64(1), int64(1), object(9)
memory usage: 26.3+ MB

In [6]:
trips.drop(['stoptime', 'bikeid', 'tripduration', 'to_station_name', 'from_station_id', 'usertype', 'gender', 'birthyear'], axis=1, inplace=True)

In [7]:
trips['date']=trips['starttime'].dt.date

In [8]:
trips.head()

   trip_id           starttime    from_station_name to_station_id        date
0      431 2014-10-13 10:31:00  2nd Ave & Spring St         PS-04  2014-10-13
1      432 2014-10-13 10:32:00  2nd Ave & Spring St         PS-04  2014-10-13
2      433 2014-10-13 10:33:00  2nd Ave & Spring St         PS-04  2014-10-13
3      434 2014-10-13 10:34:00  2nd Ave & Spring St         PS-04  2014-10-13
4      435 2014-10-13 10:34:00  2nd Ave & Spring St         PS-04  2014-10-13

In [9]:
trips.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 286858 entries, 0 to 286857
Data columns (total 5 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   trip_id            286858 non-null  int64
 1   starttime          286858 non-null  datetime64[ns]
 2   from_station_name  286858 non-null  object
 3   to_station_id      286858 non-null  object
 4   date               286858 non-null  object
dtypes: datetime64[ns](1), int64(1), object(3)
memory usage: 10.9+ MB

In [10]:
trips['date'] = pd.to_datetime(trips['date'])

In [11]:
trips.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 286858 entries, 0 to 286857
Data columns (total 5 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   trip_id            286858 non-null  int64
 1   starttime          286858 non-null  datetime64[ns]
 2   from_station_name  286858 non-null  object
 3   to_station_id      286858 non-null  object
 4   date               286858 non-null  datetime64[ns]
dtypes: datetime64[ns](2), int64(1), object(2)
memory usage: 10.9+ MB

In [12]:
trips.drop(['starttime'], axis=1, inplace=True)

In [13]:
trips.head()

   trip_id    from_station_name to_station_id       date
0      431  2nd Ave & Spring St         PS-04 2014-10-13
1      432  2nd Ave & Spring St         PS-04 2014-10-13
2      433  2nd Ave & Spring St         PS-04 2014-10-13
3      434  2nd Ave & Spring St         PS-04 2014-10-13
4      435  2nd Ave & Spring St         PS-04 2014-10-13

In [14]:
stations.head()

,station_id,name,lat,long,install_date,install_dockcount,modification_date,current_dockcount,decommission_date
0,BT-01,3rd Ave & Broad St,47.618418,-122.350964,10/13/2014,18,NaN,18,NaN
1,BT-03,2nd Ave & Vine St,47.615829,-122.348564,10/13/2014,16,NaN,16,NaN
2,BT-04,6th Ave & Blanchard St,47.616094,-122.341102,10/13/2014,16,NaN,16,NaN
3,BT-05,2nd Ave & Blanchard St,47.613110,-122.344208,10/13/2014,14,NaN,14,NaN
4,CBD-03,7th Ave & Union St,47.610731,-122.332447,10/13/2014,20,NaN,20,NaN

In [15]:
stations.decommission_date.unique()

array([nan, '8/9/2016', '3/18/2016', '7/2/2016', '10/29/2015'],
      dtype=object)

In [16]:
active_stations=stations[stations['decommission_date'].isnull()]

In [17]:
active_stations.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 54 entries, 0 to 57
Data columns (total 9 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   station_id         54 non-null     object
 1   name               54 non-null     object
 2   lat                54 non-null     float64
 3   long               54 non-null     float64
 4   install_date       54 non-null     object
 5   install_dockcount  54 non-null     int64
 6   modification_date  13 non-null     object
 7   current_dockcount  54 non-null     int64
 8   decommission_date  0 non-null      object
dtypes: float64(2), int64(2), object(5)
memory usage: 4.2+ KB

In [18]:
active_stations.head()

,station_id,name,lat,long,install_date,install_dockcount,modification_date,current_dockcount,decommission_date
0,BT-01,3rd Ave & Broad St,47.618418,-122.350964,10/13/2014,18,NaN,18,NaN
1,BT-03,2nd Ave & Vine St,47.615829,-122.348564,10/13/2014,16,NaN,16,NaN
2,BT-04,6th Ave & Blanchard St,47.616094,-122.341102,10/13/2014,16,NaN,16,NaN
3,BT-05,2nd Ave & Blanchard St,47.613110,-122.344208,10/13/2014,14,NaN,14,NaN
4,CBD-03,7th Ave & Union St,47.610731,-122.332447,10/13/2014,20,NaN,20,NaN

In [19]:
active_stations.drop(['lat', 'long', 'install_date', 'install_dockcount', 'modification_date', 'current_dockcount', 'decommission_date'], axis=1, inplace=True)

C:\Users\Admin\AppData\Local\Temp\ipykernel_2060\2501451880.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  active_stations.drop(['lat', 'long', 'install_date', 'install_dockcount', 'modification_date', 'current_dockcount', 'decommission_date'], axis=1, inplace=True)

In [20]:
active_stations.head()

  station_id                    name
0      BT-01      3rd Ave & Broad St
1      BT-03       2nd Ave & Vine St
2      BT-04  6th Ave & Blanchard St
3      BT-05  2nd Ave & Blanchard St
4     CBD-03      7th Ave & Union St

In [21]:
weather.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 689 entries, 0 to 688
Data columns (total 21 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   Date                        689 non-null    object
 1   Max_Temperature_F           689 non-null    int64
 2   Mean_Temperature_F          688 non-null    float64
 3   Min_TemperatureF            689 non-null    int64
 4   Max_Dew_Point_F             689 non-null    int64
 5   MeanDew_Point_F             689 non-null    int64
 6   Min_Dewpoint_F              689 non-null    int64
 7   Max_Humidity                689 non-null    int64
 8   Mean_Humidity               689 non-null    int64
 9   Min_Humidity                689 non-null    int64
 10  Max_Sea_Level_Pressure_In   689 non-null    float64
 11  Mean_Sea_Level_Pressure_In  689 non-null    float64
 12  Min_Sea_Level_Pressure_In   689 non-null    float64
 13  Max_Visibility_Miles        689 non-null    int64
 14  Mean_Visibility_Miles       689 non-null    int64
 15  Min_Visibility_Miles        689 non-null    int64
 16  Max_Wind_Speed_MPH          689 non-null    int64
 17  Mean_Wind_Speed_MPH         689 non-null    int64
 18  Max_Gust_Speed_MPH          504 non-null    object
 19  Precipitation_In            689 non-null    float64
 20  Events                      328 non-null    object
dtypes: float64(5), int64(13), object(3)
memory usage: 113.2+ KB

In [22]:
weather.Min_Visibility_Miles.unique()

array([ 4,  3, 10,  6,  2,  5,  8,  9,  7,  0,  1], dtype=int64)

In [23]:
weather.drop(['Max_Temperature_F','Min_TemperatureF','Max_Dew_Point_F','MeanDew_Point_F','Min_Dewpoint_F','Max_Humidity','Mean_Humidity','Min_Humidity','Max_Sea_Level_Pressure_In','Mean_Sea_Level_Pressure_In','Min_Sea_Level_Pressure_In','Max_Visibility_Miles','Mean_Visibility_Miles','Min_Visibility_Miles','Min_Visibility_Miles','Max_Wind_Speed_MPH','Max_Gust_Speed_MPH'], axis=1, inplace=True)

In [24]:
weather.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 689 entries, 0 to 688
Data columns (total 5 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Date                 689 non-null    object
 1   Mean_Temperature_F   688 non-null    float64
 2   Mean_Wind_Speed_MPH  689 non-null    int64
 3   Precipitation_In     689 non-null    float64
 4   Events               328 non-null    object
dtypes: float64(2), int64(1), object(2)
memory usage: 27.0+ KB

In [25]:
weather['Date'] = pd.to_datetime(weather['Date'])

In [27]:
#weather.drop(['date'], axis=1, inplace=True)

In [28]:
weather.head()

        Date  Mean_Temperature_F  Mean_Wind_Speed_MPH  Precipitation_In Events
0 2014-10-13                62.0                    4              0.00   Rain
1 2014-10-14                59.0                    5              0.11   Rain
2 2014-10-15                58.0                    7              0.45   Rain
3 2014-10-16                61.0                    4              0.00   Rain
4 2014-10-17                60.0                    3              0.14   Rain

In [29]:
weather.columns=weather.columns.str.lower()

In [30]:
trips.columns=trips.columns.str.lower()

In [31]:
trips

,trip_id,from_station_name,to_station_id,date
0,431,2nd Ave & Spring St,PS-04,2014-10-13
1,432,2nd Ave & Spring St,PS-04,2014-10-13
2,433,2nd Ave & Spring St,PS-04,2014-10-13
3,434,2nd Ave & Spring St,PS-04,2014-10-13
4,435,2nd Ave & Spring St,PS-04,2014-10-13
...,...,...,...,...
286853,255241,Harvard Ave & E Pine St,CBD-06,2016-08-31
286854,255242,Cal Anderson Park / 11th Ave & Pine St,ID-04,2016-08-31
286855,255243,Cal Anderson Park / 11th Ave & Pine St,ID-04,2016-08-31
286856,255244,Cal Anderson Park / 11th Ave & Pine St,ID-04,2016-08-31
286857,255245,Cal Anderson Park / 11th Ave & Pine St,ID-04,2016-08-31